app/views/home/index.html.erb

   <!-- Dynamic Browser Tab Title from Avo -->
    <title><%= PageContent.find_by(key: 'site_title')&.content || 'Hotel Boutique' %></title>
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'home_hero_title' LIMIT 1

    <!-- Logo image check... -->
    <% brand_settings = PageContent.find_by(key: 'global') %>
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'home_hero_subtitle' LIMIT 1

      <div class="text-center px-4">
          <p class="text-amber-500 tracking-widest mb-4 uppercase text-sm"><%= PageContent.find_by(key: 'home_welcome_title')&.content || 'Bienvenido al Hotel Mesón' %></p>
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'home_features_title' LIMIT 1

          <h1 class="text-5xl md:text-7xl font-bold mb-6">
              <%= raw(PageContent.find_by(key: 'home_hero_title')&.content || 'Hotel Mesón') %>
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'home_features_subtitle' LIMIT 1

            <div class="grid grid-cols-1 md:grid-cols-3 gap-8">
                <% (@rooms.presence || Room.order(:position, :id)).each do |room| %>
---
SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."position" ASC, "rooms"."id" ASC

            <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-4 gap-6">
                <% (@experiences.presence || Experience.order(:position, :id)).each_with_index do |exp, idx| %>
---
SELECT "experiences".* FROM "experiences" ORDER BY "experiences"."position" ASC, "experiences"."id" ASC

                <p class="text-amber-500 tracking-widest mb-2 uppercase text-sm">Querétaro</p>
                <h2 class="text-4xl md:text-5xl font-serif font-bold"><%= PageContent.find_by(key: 'home_activities_title')&.content || 'Qué hacer en Querétaro' %></h2>
                <p class="text-gray-400 mt-4 max-w-2xl mx-auto"><%= PageContent.find_by(key: 'home_activities_subtitle')&.content || 'Restaurantes, puntos de interés y tours que hacen único tu viaje a Querétaro.' %></p>
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'home_location_desc' LIMIT 1
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'address_line' LIMIT 1