app/views/home/index.html.erb

          <!-- Large Centered Hero Emblem -->
          <% brand_settings = PageContent.find_by(key: 'global') %>
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'home_location_title' LIMIT 1