app/helpers/page_contents_helper.rb

SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'global' LIMIT 1
---
    def dynamic_logo
      page_content = PageContent.find_by(key: 'global')

SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'global' LIMIT 1
---
    def dynamic_favicon
      page_content = PageContent.find_by(key: 'global')

SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."key" = 'standard_room_image' LIMIT 1
---
    def page_content(key)
      pc = PageContent.find_by(key: key.to_s)