app/controllers/home_controller.rb

  def index
    # "/", "/es", "/home/index" and "/es/home/index" all land here; the bare
    # root is the one form search engines should keep (see SeoHelper).
    seo_canonical { |options| root_url(**options) }

    @rooms = Room.with_attached_photos.order(:position, :id)
    @experiences = Experience.order(:position, :id)
---
SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."position" ASC, "rooms"."id" ASC
SELECT "experiences".* FROM "experiences" ORDER BY "experiences"."position" ASC, "experiences"."id" ASC