app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers"
---
  def index
    @offers = Offer.all

INSERT INTO "offers" ("created_at", "description", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-08-07 03:26:19.581444"], ["description", "MyText"], ["price", 9.99], ["title", "MyString"], ["updated_at", "2026-08-07 03:26:19.581444"]]
---
  def create
    @offer = Offer.new(offer_params)

    if @offer.save

DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 980190962]]
---
  def destroy
    @offer.destroy!

SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_offer
      @offer = Offer.find(params.expect(:id))