app/controllers/page_contents_controller.rb

  def index
    @page_contents = PageContent.all
---
SELECT "page_contents".* FROM "page_contents"

  def create
    @page_content = PageContent.new(page_content_params)

    if @page_content.save
---
INSERT INTO "page_contents" ("content", "created_at", "key", "title", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "MyText"], ["created_at", "2026-08-07 03:26:19.489318"], ["key", "MyString"], ["title", "MyString"], ["updated_at", "2026-08-07 03:26:19.489318"]]

  def destroy
    @page_content.destroy!
---
DELETE FROM "page_contents" WHERE "page_contents"."id" = ?  [["id", 980190962]]

    def set_page_content
      @page_content = PageContent.find(params.expect(:id))
---
SELECT "page_contents".* FROM "page_contents" WHERE "page_contents"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]